---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RunTopLowerThanBottomFailure
source: html/02d5162f-3eba-121e-f627-a6951ac1bf7b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RunTopLowerThanBottomFailure Property

The top elevation for the run is lower than the base elevation for the run.

## Syntax (C#)
```csharp
public static FailureDefinitionId RunTopLowerThanBottomFailure { get; }
```